app/controllers/products_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` IN (4, 7, 36, 2, 33, 3, 1)
SELECT id, title, url, img, price, source,appraisal, user_id, created_at, reply_num, money_logo FROM `products` ORDER BY created_at DESC LIMIT 30
---
  def index
    @products = Product.short.includes(:user).order_by_created_at_desc.paginate(page: params[:page])