app/controllers/products_controller.rb

SELECT COUNT(*) FROM `products`
SELECT id, title, url, img, price, source,appraisal, user_id, created_at, reply_num, money_logo FROM `products` ORDER BY created_at DESC LIMIT 30 OFFSET 30
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2, 3)
---
  def scroll

    offset = params[:offset].nil? ? Product.per_page : params[:offset].to_i

    if Product.count <= offset

      render json: { text: 0 }

    elsif Product.count > offset && Product.count - offset < Product.per_page

      limit = Product.count - offset
      @products = Product.short.includes(:user).order_by_created_at_desc.limit(limit).offset(offset)